''' 
Το μόνο που χρειάζεται να ξέρεις για αρχή είναι ότι ο κώδικας τρέχει από
πάνω προς τα κάτω. Τρέξε αυτόν τον κώδικα και δες τα αποτελέσματα.
Διαβασε τα σχόλια που υπάρχουν στον κώδικα για να καταλάβεις τι κάνει .
'''

''' 
Αυτό είναι ένα σχόλιο.
Μπορεί να έχει πολλές γραμμές
'''

# Αυτό είναι ένα σχόλιο της μιας γραμμής

print("Η print είναι η εντολή που χρησιμοποιούμε για να τυπώσουμε κάτι στην οθόνη")
print("Θα την χρησιμοποιήσουμε πολύ παρακάτω")

string = '''
_____________________________________________
Μεταβλητές
_____________________________________________

'''
print(string)
'''
Για να κάνουμε υπολογισμούς χρειαζόμαστε κάπου να αποθηκεύσουμε τα αποτελέσματα.
Γι αυτό έχουμε τις μεταβλητές. Μια μεταβλητή είναι ένα όνομα που αντιστοιχεί σε 
μια τιμή. Τις ορίζουμε ως εξής:
'''
x = 5
y = 10
this_is_a_really_long_variable_name = 15
print("Η μεταβλητή x έχει την τιμή: ", x)

'''
Οι μεταβλητές μπορούν να πάρουν και να αλλάξουν τιμές ή να παρουν τιμές από
αποτελέσματα πράξεων ή συναρτήσεων.
'''
z = x + y
print("Η μεταβλητή z έχει την τιμή: ", z)

'''
Μπορούμε να χρησιμοποιήσουμε μια μεταβλήτη για να αλλάξουμε τον ευατό της.
Πχ θέλουμε να αυξήσουμε την τιμή του x κατά 1. (όταν μετράμε κάτι)
'''
x = x + 1
print("Η μεταβλητή x έχει την νέα τιμή: ", x)

string = '''
_____________________________________________
Πράξεις
_____________________________________________
'''
print(string)

'''
Μπορούμε να κάνουμε πράξεις ανάμεσα σε μεταβλητές
'''
x = 42
y = 17
# Πρόσθεση
z = x + y
print("Πρόσθεση: ", z)
# Αφαίρεση
z = x - y
print("Αφαίρεση: ", z)
# Πολλαπλασιασμός
z = x * y
print("Πολλαπλασιασμός: ", z)
# Διαίρεση
z = x / y
print("Διαίρεση: ", z) 
print("Το αποτέλεσμα με 1 / είναι δεκαδικός αριθμός. ")
# Ακέραια διαίρεση
z = x // y
print("Ακέραια διαίρεση: ", z)
# Υπόλοιπο
z = x % y
print("Υπόλοιπο της διαίρεσης x δια y: ", z)
# Δύναμη
z = x ** 2 
print("Δύναμη x στο τετράγωνο: ", z)

string = '''
_____________________________________________
Συγκρισεις
_____________________________________________
'''
print(string)

'''
Οι συγκρίσεις επιστρέφουν είτε True είτε False ανάλογα με το αν είναι αληθείς ή όχι
1 > 2 -> False
1 < 2 -> True

    Μικρότερο: x < y
    Μεγαλύτερο: x > y
    Ίσο: x == y
    Μικρότερο ή ίσο: x <= y
    Μεγαλύτερο ή ίσο: x >= y
    Άνισο: x != y
'''
x = 42
y = 17
# Μεγαλύτερο
z = x > y
print("Είναι το x μεγαλύτερο από το y: ", z)
# Μικρότερο
z = x < y
print("Είναι το x μικρότερο από το y: ", z)

string = '''
_____________________________________________
ΣΥΝΘΗΚΕΣ
_____________________________________________
'''
print(string)

'''
Δεν θέλουμε πάντα να συμβαίνει το ίδιο πράγμα ανεξαρτήτως της κατάστασης.
Έστω ότι θέλουμε να κάνουμε κάτι αν το x είναι μεγαλύτερο από το y και κάτι άλλο
διαφορετικά. Αυτό το επιτυγχάνουμε με την if
'''
x = 42
y = 17
if x > y:
    print("Το x είναι μεγαλύτερο από το y")
    x = x + 1
    y = 10 * y
else:
    print("Αυτό δεν θα τρέξει αφού 42 > 17")
print("Πλεον έχουμε βγει από το if else")

'''
Παρατηρούμε ότι στο τέλος του if και του else βάζουμε άνω και κάτω τελία :
Επίσης όσο γράφουμε τις εντολές μέσα στο if ή το else χρειαζόμαστε στοίχιση
πατώντας το κουμπί TAB (πάνω από το CAPS LOCK)
'''

'''Μπορούμε να έχουμε οτιδήποτε μέσα στο if και το else'''
x = 42
y = 17
if x > y:
    if x == 42:
        print("Το x είναι 42") 
    # δεν χρειάζεται απαραίτητα το else
else:
    print("Αυτό δεν θα τρέξει αφού 42 > 17")


string = '''
_____________________________________________
ΕΠΑΝΑΛΗΨΕΙΣ
_____________________________________________
'''
print(string)

''' Υπάρχουν 2 βασικοί τρόποι να κάνουμε επανάληψη την python. Το for και το while'''


'''
Το for μπορούμε να το χρησιμοποιήσουμε όταν ξέρουμε τον αριθμό επαναλήψεων που
θέλουμε να κάνουμε

Πχ 5
'''
x = 0
print("Αυτή η εντολή είναι έξω από το for και θα εκτελεστεί μόνο στην αρχή")
for _ in range(5):
    x = x + 1
    print(x)
print("Αυτή η εντολή είναι έξω από το for και θα εκτελεστεί μόνο στο τέλος")

'''ή n φορές αν το n είναι ακέραιος'''

n = 7
for i in range(n):
    print("Το i θα αρχίσει από την τιμή 0 και θα αυξάνει κατά 1 σε κάθε επανάληψη μέχρι να πάρει την τιμή n-1")
    print(i)
    

'''Το while εκτελείται όσο μια συνθήκη είναι αληθής, δηλαδή True'''

'''
while 1 > 0:
    print("Αυτό το while θα τρέχει για πάντα γι αυτό το έχουμε σε σχόλιο")
'''
    
x = 0
while x < 5:
    x = x + 1
'''Αυτό τρέχει μέχρι το x να γίνει 5'''

'''Έστω ότι θέλω να δω ποια είναι η μεγαλύτερη δύναμη του 2 που είναι μικρότερη από το 1000'''
power = 0
while 2 ** power < 1000:
    power = power + 1
print("Αφού βγήκα από το while πλέον δεν ισχύει, άρα πρέπει να αφαιρέσω 1")
power = power - 1
print("Η λύση είναι:")
print(power)